OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18f95j94.c
__at(0x0E9F) __sfr LCDDATA17;
__at(0x0E9F) volatile __LCDDATA17bits_t LCDDATA17bits;

__at(0x0EA0) __sfr LCDDATA18;
__at(0x0EA0) volatile __LCDDATA18bits_t LCDDATA18bits;

__at(0x0EA1) __sfr LCDDATA19;
__at(0x0EA1) volatile __LCDDATA19bits_t LCDDATA19bits;

__at(0x0EA2) __sfr LCDDATA20;
__at(0x0EA2) volatile __LCDDATA20bits_t LCDDATA20bits;

__at(0x0EA3) __sfr LCDDATA21;
__at(0x0EA3) volatile __LCDDATA21bits_t LCDDATA21bits;

__at(0x0EA4) __sfr LCDDATA22;
__at(0x0EA4) volatile __LCDDATA22bits_t LCDDATA22bits;

__at(0x0EA5) __sfr LCDDATA23;
__at(0x0EA5) volatile __LCDDATA23bits_t LCDDATA23bits;

__at(0x0EA6) __sfr LCDDATA24;
__at(0x0EA6) volatile __LCDDATA24bits_t LCDDATA24bits;

__at(0x0EA7) __sfr LCDDATA25;
__at(0x0EA7) volatile __LCDDATA25bits_t LCDDATA25bits;

__at(0x0EA8) __sfr LCDDATA26;
__at(0x0EA8) volatile __LCDDATA26bits_t LCDDATA26bits;

__at(0x0EA9) __sfr LCDDATA27;
__at(0x0EA9) volatile __LCDDATA27bits_t LCDDATA27bits;

__at(0x0EAA) __sfr LCDDATA28;
__at(0x0EAA) volatile __LCDDATA28bits_t LCDDATA28bits;

__at(0x0EAB) __sfr LCDDATA29;
__at(0x0EAB) volatile __LCDDATA29bits_t LCDDATA29bits;

__at(0x0EAC) __sfr LCDDATA30;
__at(0x0EAC) volatile __LCDDATA30bits_t LCDDATA30bits;

__at(0x0EAD) __sfr LCDDATA31;
__at(0x0EAD) volatile __LCDDATA31bits_t LCDDATA31bits;

__at(0x0EAE) __sfr LCDDATA32;
__at(0x0EAE) volatile __LCDDATA32bits_t LCDDATA32bits;

__at(0x0EAF) __sfr LCDDATA33;
__at(0x0EAF) volatile __LCDDATA33bits_t LCDDATA33bits;

__at(0x0EB0) __sfr LCDDATA34;
__at(0x0EB0) volatile __LCDDATA34bits_t LCDDATA34bits;

__at(0x0EB1) __sfr LCDDATA35;
__at(0x0EB1) volatile __LCDDATA35bits_t LCDDATA35bits;

__at(0x0EB2) __sfr LCDDATA36;
__at(0x0EB2) volatile __LCDDATA36bits_t LCDDATA36bits;

__at(0x0EB3) __sfr LCDDATA37;
__at(0x0EB3) volatile __LCDDATA37bits_t LCDDATA37bits;

__at(0x0EB4) __sfr LCDDATA38;
__at(0x0EB4) volatile __LCDDATA38bits_t LCDDATA38bits;

__at(0x0EB5) __sfr LCDDATA39;
__at(0x0EB5) volatile __LCDDATA39bits_t LCDDATA39bits;

__at(0x0EB6) __sfr LCDDATA40;
__at(0x0EB6) volatile __LCDDATA40bits_t LCDDATA40bits;

__at(0x0EB7) __sfr LCDDATA41;
__at(0x0EB7) volatile __LCDDATA41bits_t LCDDATA41bits;

__at(0x0EB8) __sfr LCDDATA42;
__at(0x0EB8) volatile __LCDDATA42bits_t LCDDATA42bits;

__at(0x0EB9) __sfr LCDDATA43;
__at(0x0EB9) volatile __LCDDATA43bits_t LCDDATA43bits;

__at(0x0EBA) __sfr LCDDATA44;
__at(0x0EBA) volatile __LCDDATA44bits_t LCDDATA44bits;

__at(0x0EBB) __sfr LCDDATA45;
__at(0x0EBB) volatile __LCDDATA45bits_t LCDDATA45bits;

__at(0x0EBC) __sfr LCDDATA46;
__at(0x0EBC) volatile __LCDDATA46bits_t LCDDATA46bits;

__at(0x0EBD) __sfr LCDDATA47;
__at(0x0EBD) volatile __LCDDATA47bits_t LCDDATA47bits;

__at(0x0EBE) __sfr LCDDATA48;
__at(0x0EBE) volatile __LCDDATA48bits_t LCDDATA48bits;

__at(0x0EBF) __sfr LCDDATA49;
__at(0x0EBF) volatile __LCDDATA49bits_t LCDDATA49bits;

__at(0x0EC0) __sfr LCDDATA50;
__at(0x0EC0) volatile __LCDDATA50bits_t LCDDATA50bits;

__at(0x0EC1) __sfr LCDDATA51;
__at(0x0EC1) volatile __LCDDATA51bits_t LCDDATA51bits;

__at(0x0EC2) __sfr LCDDATA52;
__at(0x0EC2) volatile __LCDDATA52bits_t LCDDATA52bits;

__at(0x0EC3) __sfr LCDDATA53;
__at(0x0EC3) volatile __LCDDATA53bits_t LCDDATA53bits;

__at(0x0EC4) __sfr LCDDATA54;
__at(0x0EC4) volatile __LCDDATA54bits_t LCDDATA54bits;

__at(0x0EC5) __sfr LCDDATA55;
__at(0x0EC5) volatile __LCDDATA55bits_t LCDDATA55bits;

__at(0x0EC6) __sfr LCDDATA56;
__at(0x0EC6) volatile __LCDDATA56bits_t LCDDATA56bits;

__at(0x0EC7) __sfr LCDDATA57;
__at(0x0EC7) volatile __LCDDATA57bits_t LCDDATA57bits;

__at(0x0EC8) __sfr LCDDATA58;
__at(0x0EC8) volatile __LCDDATA58bits_t LCDDATA58bits;

__at(0x0EC9) __sfr LCDDATA59;
__at(0x0EC9) volatile __LCDDATA59bits_t LCDDATA59bits;

__at(0x0ECA) __sfr LCDDATA60;
__at(0x0ECA) volatile __LCDDATA60bits_t LCDDATA60bits;

__at(0x0ECB) __sfr LCDDATA61;
__at(0x0ECB) volatile __LCDDATA61bits_t LCDDATA61bits;

__at(0x0ECC) __sfr LCDDATA62;
__at(0x0ECC) volatile __LCDDATA62bits_t LCDDATA62bits;

__at(0x0ECD) __sfr LCDDATA63;
__at(0x0ECD) volatile __LCDDATA63bits_t LCDDATA63bits;

__at(0x0ECE) __sfr LCDSE0;
__at(0x0ECE) volatile __LCDSE0bits_t LCDSE0bits;

__at(0x0ECF) __sfr LCDSE1;
__at(0x0ECF) volatile __LCDSE1bits_t LCDSE1bits;

__at(0x0ED0) __sfr LCDSE2;
__at(0x0ED0) volatile __LCDSE2bits_t LCDSE2bits;

__at(0x0ED1) __sfr LCDSE3;
__at(0x0ED1) volatile __LCDSE3bits_t LCDSE3bits;

__at(0x0ED2) __sfr LCDSE4;
__at(0x0ED2) volatile __LCDSE4bits_t LCDSE4bits;

__at(0x0ED3) __sfr LCDSE5;
__at(0x0ED3) volatile __LCDSE5bits_t LCDSE5bits;

__at(0x0ED4) __sfr LCDSE6;
__at(0x0ED4) volatile __LCDSE6bits_t LCDSE6bits;

__at(0x0ED5) __sfr LCDSE7;
__at(0x0ED5) volatile __LCDSE7bits_t LCDSE7bits;

__at(0x0ED6) __sfr LCDRL;
__at(0x0ED6) volatile __LCDRLbits_t LCDRLbits;

__at(0x0ED7) __sfr LCDREF;
__at(0x0ED7) volatile __LCDREFbits_t LCDREFbits;

__at(0x0ED8) __sfr LCDREG;
__at(0x0ED8) volatile __LCDREGbits_t LCDREGbits;

__at(0x0ED9) __sfr LCDCON;
__at(0x0ED9) volatile __LCDCONbits_t LCDCONbits;

__at(0x0EDA) __sfr LCDPS;
__at(0x0EDA) volatile __LCDPSbits_t LCDPSbits;

__at(0x0EDB) __sfr REFO2CON3;
__at(0x0EDB) volatile __REFO2CON3bits_t REFO2CON3bits;

__at(0x0EDC) __sfr REFO2CON2;
__at(0x0EDC) volatile __REFO2CON2bits_t REFO2CON2bits;

__at(0x0EDD) __sfr REFO2CON1;
__at(0x0EDD) volatile __REFO2CON1bits_t REFO2CON1bits;

__at(0x0EDE) __sfr REFO2CON;
__at(0x0EDE) volatile __REFO2CONbits_t REFO2CONbits;

__at(0x0EDF) __sfr REFO1CON3;
__at(0x0EDF) volatile __REFO1CON3bits_t REFO1CON3bits;

__at(0x0EE0) __sfr REFO1CON2;
__at(0x0EE0) volatile __REFO1CON2bits_t REFO1CON2bits;

__at(0x0EE1) __sfr REFO1CON1;
__at(0x0EE1) volatile __REFO1CON1bits_t REFO1CON1bits;

__at(0x0EE2) __sfr REFO1CON;
__at(0x0EE2) volatile __REFO1CONbits_t REFO1CONbits;

__at(0x0EE3) __sfr MEMCON;
__at(0x0EE3) volatile __MEMCONbits_t MEMCONbits;

__at(0x0EE4) __sfr PORTL;
__at(0x0EE4) volatile __PORTLbits_t PORTLbits;

__at(0x0EE5) __sfr LATL;
__at(0x0EE5) volatile __LATLbits_t LATLbits;

__at(0x0EE6) __sfr TRISL;
__at(0x0EE6) volatile __TRISLbits_t TRISLbits;

__at(0x0EE7) __sfr PORTK;
__at(0x0EE7) volatile __PORTKbits_t PORTKbits;

__at(0x0EE8) __sfr LATK;
__at(0x0EE8) volatile __LATKbits_t LATKbits;

__at(0x0EE9) __sfr TRISK;
__at(0x0EE9) volatile __TRISKbits_t TRISKbits;

